--Задание 2.4. Использование подзапросов

--1. Выдать всех поставщиков (колонка CompanyName в таблице Suppliers), у которых 
--нет хотя бы одного продукта на складе (UnitsInStock в таблице Products равно 0). 
--Использовать вложенный SELECT для этого запроса с использованием оператора IN.



--2. Выдать всех продавцов, которые имеют более 150 заказов. Использовать вложенный 
--SELECT.



--3. Выдать всех заказчиков (таблица Customers), которые не имеют ни одного заказа 
--(подзапрос по таблице Orders). Использовать оператор EXISTS.

